export default defineI18nConfig(() => ({
  legacy: false,
  locale: "th",
  messages: {
    th: {
      navigation: {
        home: "หน้าหลัก",
        newshouse: "หอประกายข่าว",
        media: {
          title: "สื่อสนุก",
          songs: "เพลง",
          animations: "อนิเมชั่น",
          gallery: "ห้องชมภาพ",
          ebooks: "หนังสืออิเล็กทรอนิกส์ (E-Books)",
        },
        "glittering-yard": "ลานเรืองแสง",
        club: "คลับหิ่งห้อยน้อย",
        support: "สนับสนุนเรา",
        "user-manual": "วิธีใช้งาน",
      },
      modal: {
        end: {
          close: "ปิด",
          finish: "เสร็จสิ้น",
          next: "ถัดไป",
          previous: "ก่อนหน้า",
          back: "ย้อนกลับ",
          ok: "ตกลง",
        },
        title: {
          error: "เกิดข้อผิดพลาด",
          success: "สำเร็จ",
        },
      },
      user: {
        accomplishment: [
          {
            title: "ก้าวแรกสู่ความสำเร็จ",
            description: "ความสำเร็จเริ่มต้นด้วยตัวคุณเอง คุณคือผู้กำหนดอนาคตของคุณ!",
            unlock: "สร้างโพรไฟล์ URGROWTH",
          },
        ],
        update: {
          handle: {
            required: "ชื่อผู้ใช้ต้องไม่ว่างเปล่า",
            maxLength: "ชื่อผู้ใช้ต้องไม่เกิน 32 ตัวอักษร",
            minLength: "ชื่อผู้ใช้ต้องมีมากกว่า 3 ตัวอักษร",
            pattern: "ชื่อผู้ใช้ต้องประกอบด้วยตัวอักษรภาษาอังกฤษ ตัวเลข และขีดล่างเท่านั้น",
            taken: "ชื่อผู้ใช้นี้ถูกใช้ไปแล้ว",
          },
          fullName: {
            required: "ชื่อโพรไฟล์ต้องไม่ว่างเปล่า",
            maxLength: "ชื่อโพรไฟล์ต้องไม่เกิน 64 ตัวอักษร",
          },
          bio: {
            maxLength: "ประวัติต้องไม่เกิน 256 ตัวอักษร",
          },
          introduction: {
            maxLength: "ต้องไม่เกิน 2048 ตัวอักษร",
          },
          success: "อัพเดทโพรไฟล์สำเร็จ!",
        },
        edit: {
          charLeft: "ตัวอักษรที่เหลือ",
          tagsLeft: "ชนิดที่เหลือ",
          save: "บันทึก",
          cancel: "ยกเลิก",
        },
        profile: {
          notFound: "🤔 อ๊ะ พวกเราไม่พบผู้ใช้นี้ แน่ใจไหมว่าคุณพิมพ์แฮนเดิล (ชื่อผู้ใช้) ที่ถูกต้อง?",
          edit: "แก้ไขโพรไฟล์",
          logout: "ออกจากระบบ",
          fullName: "ชื่อโพรไฟล์",
          location: "ที่อยู่",
          handle: "แฮนเดิล (ชื่อผู้ใช้)",
          bio: {
            title: "ประวัติ",
            empty: "🤔 เราไม่รู้เกี่ยวกับเขา... แต่คิดว่าเขาคงเป็นคนดี",
          },
          introduction: {
            title: "แนะนำตัว",
            empty: "🤔 เราไม่รู้เกี่ยวกับเขา... แต่เขาคงมีความฝันอันยิ่งใหญ่",
          },
        },
        comment: {
          needlogin: "คุณต้องเข้าสู่ระบบก่อนที่จะแสดงความคิดเห็น",
        },
        permission: "คุณไม่ได้รับอนุญาตให้ดำเนินการนี้",
      },
      article: {
        delete: "ลบบทความ",
        read: "อ่านบทความ",
        notfound: "ไม่พบบทความนี้",
        submit: {
          title: "เผยแพร่",
          submitting: "โปรดรอสักครู่ กำลังสร้างบทความ...",
          error: "เกิดข้อผิดพลาดในการสร้างบทความ",
        },
        cancel: "ยกเลิก",
        title: {
          title: "ชื่อบทความ",
          required: "ชื่อบทความต้องไม่ว่างเปล่า",
        },
        content: {
          title: "เนื้อหา",
          required: "เนื้อหาต้องไม่ว่างเปล่า",
          preview: "ตัวอย่าง",
        },
        coverImg: {
          title: "รูปภาพปก",
        },
        tags: {
          title: "แท็ก (แยกด้วยเว้นวรรค)",
          required: "แท็กต้องไม่ว่างเปล่า",
        },
        edit: {
          coverImg: {
            required: "กรุณาเลือกรูปภาพปก",
            type: "รูปภาพปกต้องเป็นไฟล์ประเภท .jpg, .jpeg, .png, .gif, หรือ .webp เท่านั้น",
            error: "เกิดข้อผิดพลาดในการอัปโหลดรูปภาพ",
          }
        },
        success: "บทความถูกสร้างเรียบร้อยแล้ว!",
      }
    }
  }
}));